Reports/ЛБ_ОтчетПоКлиентамВСтатусеВИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_ОтчетПоКлиентамВСтатусеВИП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентамиБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентамиБУ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КонтактнаяИнформацияЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КонтактнаяИнформацияЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияСтрана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияОбласть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияНаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПрописке</Name>
					<Comment>Адрес по прописке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Comment>Фактический адрес</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Comment>Адрес для почтовой рассылки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительный</Name>
					<Comment>Телефон дополнительный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительныйСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email</Name>
					<Comment>E-mail</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛицаСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформацииДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОснованияИзмененияФИО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяАдресПрописки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияАдресаПоПрописке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФактическогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияПочтовогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЛомбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ЛБ_ОтчетПоКлиентамВСтатусеВИП/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Результат.Очистить();  
	
	ДатаНач = Отчет.ДатаНач;
	ДатаКон = ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон));
	
	Если ЗначениеЗаполнено(Отчет.Залогодатель) Тогда
		РезультатЗапроса = Новый ТаблицаЗначений;
		РезультатЗапроса.Колонки.Добавить("Залогодатель");
		
		НоваяСтр = РезультатЗапроса.Добавить();
		НоваяСтр.Залогодатель = Отчет.Залогодатель;
	Иначе
		РезультатЗапроса = ПолучитьСписокЗалогодателей(ДатаКон);
	КонецЕсли;
	
	Результат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КлиентыВСтатусеВИП";
	
	Макет = Отчет.РеквизитМакет;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Если ДатаНач = Дата(1,1,1) Тогда 
	    ПериодОтчета = "на " + Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	Иначе
		ПериодОтчета = "с " + Формат(ДатаНач, "ДФ=dd.MM.yyyy") + " по " + Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	КонецЕсли;	

	ОбластьШапка.Параметры.Период = ПериодОтчета; 
	Результат.Вывести(ОбластьШапка); 

	Для каждого Стр Из РезультатЗапроса Цикл
		ДействующийПриказ = НайтиДействующийПриказ(ДатаНач, Стр.Залогодатель);
		СруктураПроверкиСмерти = ПроверитьФактСмерти(ДатаКон, Стр.Залогодатель);

		Если СруктураПроверкиСмерти.ДатаСмерти <> Дата(1,1,1) И НачалоДня(СруктураПроверкиСмерти.ДатаИзменения) < НачалоДня(ДатаНач) Тогда
			Продолжить;
		КонецЕсли;

		Если ДействующийПриказ = Неопределено Тогда
			ДатаНачалаПоиска = ДатаНач;
		Иначе
			ДатаНачалаПоиска = ?(НачалоДня(ДействующийПриказ[0].ДатаНачалаДействия) > НачалоДня(ДействующийПриказ[0].ДатаДокумента), ДействующийПриказ[0].ДатаНачалаДействия, ДействующийПриказ[0].ДатаДокумента);
		КонецЕсли;
		
		Ломбард = ПолучитьЛомбардСозданияКарточки(ДатаКон, Стр.Залогодатель);
		Отделение = ?(Ломбард = Неопределено, "", ПолучитьОтделениеЛомбарда(ДатаКон, Ломбард));
		//ДатаРождения = ПолучитьДатуРожденияЗалогодателя(ДатаКон, Стр.Залогодатель);
		
		ПриказыЗаПериод = ПолучитьПриказыЗаПериод(ДатаНачалаПоиска - 1, ДатаКон, ДатаНач, Стр.Залогодатель);
		
		Если ПриказыЗаПериод <> Неопределено Тогда
			Для каждого СтрП Из ПриказыЗаПериод Цикл
				
				ДатаНачалаПроверки = ?(НачалоДня(СтрП.Регистратор.ДатаНачалаДействияПриказа) > НачалоДня(СтрП.Регистратор.Дата), СтрП.Регистратор.ДатаНачалаДействияПриказа, СтрП.Регистратор.Дата);
				ДатаКонцаПроверки = ?(СтрП.Регистратор.ДатаОкончанияДействияПриказа = Дата(1,1,1), ДатаКон, СтрП.Регистратор.ДатаОкончанияДействияПриказа);
				
				СтруктураПроверки = ПроверитьНаличиеНовыхПриказов(ДатаНачалаПроверки, ДатаКонцаПроверки, Стр.Залогодатель, СтрП.Регистратор, ДатаКон);
				
				Если СтруктураПроверки.ДатаОтмены = Неопределено ИЛИ НачалоДня(СтруктураПроверки.ДатаОтмены) >= НачалоДня(ДатаНач) Тогда
					ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
					ОбластьСтрока.Параметры.Отделение = Отделение;
					ОбластьСтрока.Параметры.Подразделение = ?(Ломбард = Неопределено, "", "Ломбард № " + Ломбард.НомерЛомбарда);
					ОбластьСтрока.Параметры.ФИОЗаемщика = Стр.Залогодатель;
					ОбластьСтрока.Параметры.ДатаРождения = СтрП.ДатаРождения; //?(ДатаРождения = Неопределено, "", ДатаРождения);
					ОбластьСтрока.Параметры.ДатаНачалаДействияСтатуса = СтрП.ДатаНачалаДействия;
					ОбластьСтрока.Параметры.ДатаОкончанияДействияСтатуса = ?(СтрП.ДатаОкончанияДействия = Дата(1,1,1), "-", СтрП.ДатаОкончанияДействия);
					ОбластьСтрока.Параметры.НомерПриказа = "№ " + СтрП.Регистратор.НомерПриказа + " от " + СтрП.Период;
					ОбластьСтрока.Параметры.ДокПриказа = СтрП.Регистратор;
					ОбластьСтрока.Параметры.ДатаПрисвоенияФИОИсполнителя = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрП.Регистратор.Ответственный.Сотрудник.Наименование);
					
					Если СруктураПроверкиСмерти.ДатаСмерти <> Дата(1,1,1) И СруктураПроверкиСмерти.ДатаИзменения <> Дата(1,1,1)
						И ?(СтрП.Регистратор.ДатаОкончанияДействияПриказа <> Дата(1,1,1), 
						НачалоДня(СтрП.Регистратор.ДатаОкончанияДействияПриказа) >= НачалоДня(СруктураПроверкиСмерти.ДатаИзменения), Истина) Тогда
						//СтрП.Регистратор.ДатаОкончанияДействияПриказа = Дата(1,1,1)) Тогда
						
						ОбластьСтрока.Параметры.ТекущееСостояниеСтатуса = "Досрочно прекращен";
						ОбластьСтрока.Параметры.ДатаИзмененияФИОИсполнителя = 
							"" + Формат(СруктураПроверкиСмерти.ДатаИзменения, "ДФ=dd.MM.yyyy") + " "
							+ ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СруктураПроверкиСмерти.Ответственный.Сотрудник.Наименование)
							+ " Установлена дата смерти";
					Иначе
						ОбластьСтрока.Параметры.ТекущееСостояниеСтатуса = СтруктураПроверки.Состояние;
						ОбластьСтрока.Параметры.ДатаИзмененияФИОИсполнителя = СтруктураПроверки.ТекстПриказы;
					КонецЕсли;
					
					ОбластьСтрока.Параметры.ИдивидуальныеУсловия = СтрП.Регистратор.Комментарий;
					
					Результат.Вывести(ОбластьСтрока);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Результат.ФиксацияСверху = 4;

КонецПроцедуры

&НаКлиенте
Процедура Интервал(Команда)
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
	
	Если ДиалогРедактирования.Редактировать() Тогда
		Отчет.ДатаНач	= ДиалогРедактирования.Период.ДатаНачала;
		Отчет.ДатаКон 	= ДиалогРедактирования.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЛомбардСозданияКарточки(Дата, Залогодатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_РасчетыСКлиентамиБУОбороты.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ.Обороты(, &Дата, Регистратор, Клиент = &Залогодатель) КАК ЛБ_РасчетыСКлиентамиБУОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_РасчетыСКлиентамиБУОбороты.Период";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Ломбард;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьДатуРожденияЗалогодателя(Дата, Залогодатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
		|ИЗ
		|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.ДатаРождения
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьОтделениеЛомбарда(Дата, Ломбард)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Отделение;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Документ", Расшифровка);
		
		ФормаЗ = ПолучитьФорму("ОбщаяФорма.ЛБ_ЖурналПриказовПоЗалогодателям", ПараметрыФормы,, Новый УникальныйИдентификатор());
		ФормаЗ.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеНовыхПриказов(ДатаНач, ДатаКон, Залогодатель, ПриказУстановки, ДатаОтчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачалаДействия";

	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Регистратор", ПриказУстановки);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СтруктураВозврата = Новый Структура("ТекстПриказы, Состояние, ДатаОтмены");

	ТекстП = "";
	
	МассивУдаленияСтрок = Новый Массив;
	
	ТЗСтавки = ПриказУстановки.СтавкиПроцентов.Выгрузить(, "Ставка");
	
	Для каждого СтрС Из ТЗСтавки Цикл
		Если СтрС.Ставка = 0 Тогда
			МассивУдаленияСтрок.Добавить(СтрС);
		КонецЕсли;			
	КонецЦикла;
	
	Если МассивУдаленияСтрок.Количество() > 0 Тогда
		Для каждого СтрМ Из МассивУдаленияСтрок Цикл
			ТЗСтавки.Удалить(СтрМ);
		КонецЦикла;
	КонецЕсли;

	УстановленныСтавки = ТЗСтавки.Количество() > 0;
	УстановленныМеталлы = ПриказУстановки.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
	УстановленныВставки = ПриказУстановки.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;

	Для каждого Стр Из РезультатЗапроса Цикл
		Ставки = Ложь;
		Металлы = Ложь;
		Вставки = Ложь;
	
		Если УстановленныСтавки Тогда
			Если Стр.Регистратор.СтавкиПроцентов.Количество() > 0 Тогда
					
					ТЗСтавки.Очистить();
					МассивУдаленияСтрок.Очистить();
					
					ТЗСтавки = Стр.Регистратор.СтавкиПроцентов.Выгрузить(, "Ставка");
					
					Для каждого СтрТЗ Из ТЗСтавки Цикл
						Если СтрТЗ.Ставка = 0 Тогда
							МассивУдаленияСтрок.Добавить(СтрТЗ);
						КонецЕсли;			
					КонецЦикла;
					
					Если МассивУдаленияСтрок.Количество() > 0 Тогда
						Для каждого СтрМ Из МассивУдаленияСтрок Цикл
							ТЗСтавки.Удалить(СтрМ);
						КонецЦикла;
					КонецЕсли;

					Если ТЗСтавки.Количество() > 0 Тогда
						УстановленныСтавки = НЕ ТЗСтавки.Количество() > 0;
						Ставки = Истина;
					КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если УстановленныМеталлы Тогда
			Если Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0 Тогда
				УстановленныМеталлы = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
				Металлы = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если УстановленныВставки Тогда
			Если Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0 Тогда
				УстановленныВставки = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;
				Вставки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Ставки ИЛИ Металлы ИЛИ Вставки Тогда
			
			ТекстП = ?(ТекстП = "", "", ТекстП + ", " + Символы.ПС);
			
			Если Стр.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
				ТекстП = ТекстП + "Пр. Отм №";
			Иначе
				ТекстП = ТекстП + "Пр. №";
			КонецЕсли;
			
			ТекстП = ТекстП + Стр.Регистратор.НомерПриказа + " от " + Формат(Стр.Регистратор.Дата, "ДФ=dd.MM.yyyy") + " ("
			+ ?(Ставки, "Ст.", "")
			+ ?(Металлы, ?(Ставки, ", Мет.", "Мет."), "")
			+ ?(Вставки, ?(Ставки ИЛИ Металлы, ", Вст.)", "Вст.)"), ")");

			Если ТекстП <> "" Тогда
				ТекстП = ТекстП + " " + ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Стр.Регистратор.Ответственный.Сотрудник.Наименование);
			КонецЕсли;			
		КонецЕсли;
		
		Если НЕ УстановленныСтавки И НЕ УстановленныМеталлы И НЕ УстановленныВставки Тогда
			
			СтруктураВозврата.ТекстПриказы = ТекстП;
			СтруктураВозврата.Состояние = "Досрочно прекращен";
			СтруктураВозврата.ДатаОтмены = Стр.ДатаНачалаДействия;
			
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата.ТекстПриказы = ТекстП;
	
	Если ПриказУстановки.ДатаОкончанияДействияПриказа <> Дата(1,1,1)
		И ПриказУстановки.ДатаОкончанияДействияПриказа <= ДатаОтчета Тогда
							
		СтруктураВозврата.Состояние = "Срок действия истек";
	Иначе
		СтруктураВозврата.Состояние = "Действует";
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокЗалогодателей(ДатаКон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель КАК Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель.Наименование КАК ЗалогодательНаименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(&ДатаКон, ) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель.Наименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(&ДатаКон, ) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель.Наименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(&ДатаКон, ) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗалогодательНаименование";
	
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТЗВозврата = РезультатЗапроса.Скопировать(,"Залогодатель");
	ТЗВозврата.Свернуть("Залогодатель");
	
	Если ТЗВозврата.Количество() > 0 Тогда
		Возврат ТЗВозврата;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиДействующийПриказ(ДатаНач, Залогодатель)
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Ставки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
	               |			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Металлы
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
	               |			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Вставки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
	               |			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Ставки.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ СтавкиСорт
	               |ИЗ
	               |	Ставки КАК Ставки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Ставки.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Металлы.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ МеталыСорт
	               |ИЗ
	               |	Металлы КАК Металлы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Металлы.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Металлы.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Вставки.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВставкиСорт
	               |ИЗ
	               |	Вставки КАК Вставки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Вставки.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтавкиСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ СтавкиПерв
	               |ИЗ
	               |	СтавкиСорт КАК СтавкиСорт
	               |ГДЕ
	               |	НЕ СтавкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ СтавкиСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МеталыСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ МеталыПерв
	               |ИЗ
	               |	МеталыСорт КАК МеталыСорт
	               |ГДЕ
	               |	НЕ МеталыСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ МеталыСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВставкиСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВставкиПерв
	               |ИЗ
	               |	ВставкиСорт КАК ВставкиСорт
	               |ГДЕ
	               |	НЕ ВставкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ ВставкиСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтавкиПерв.Регистратор КАК Приказ,
	               |	СтавкиПерв.Регистратор.НомерПриказа КАК НомерПриказа,
	               |	СтавкиПерв.Регистратор.НомерСистемныйЧисло КАК СистемныйНомер,
	               |	СтавкиПерв.Регистратор.Дата КАК ДатаДокумента,
	               |	СтавкиПерв.Регистратор.ДатаНачалаДействияПриказа КАК ДатаНачалаДействия,
	               |	СтавкиПерв.Регистратор.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействия,
	               |	ИСТИНА КАК Ставки,
	               |	ЛОЖЬ КАК Металлы,
	               |	ЛОЖЬ КАК Вставки
	               |ПОМЕСТИТЬ Общая
	               |ИЗ
	               |	СтавкиПерв КАК СтавкиПерв
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	МеталыПерв.Регистратор,
	               |	МеталыПерв.Регистратор.НомерПриказа,
	               |	МеталыПерв.Регистратор.НомерСистемныйЧисло,
	               |	МеталыПерв.Регистратор.Дата,
	               |	МеталыПерв.Регистратор.ДатаНачалаДействияПриказа,
	               |	МеталыПерв.Регистратор.ДатаОкончанияДействияПриказа,
	               |	ЛОЖЬ,
	               |	ИСТИНА,
	               |	ЛОЖЬ
	               |ИЗ
	               |	МеталыПерв КАК МеталыПерв
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ВставкиПерв.Регистратор,
	               |	ВставкиПерв.Регистратор.НомерПриказа,
	               |	ВставкиПерв.Регистратор.НомерСистемныйЧисло,
	               |	ВставкиПерв.Регистратор.Дата,
	               |	ВставкиПерв.Регистратор.ДатаНачалаДействияПриказа,
	               |	ВставкиПерв.Регистратор.ДатаОкончанияДействияПриказа,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	ИСТИНА
	               |ИЗ
	               |	ВставкиПерв КАК ВставкиПерв
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Общая.Приказ КАК Регистратор,
	               |	Общая.НомерПриказа КАК НомерПриказа,
	               |	Общая.СистемныйНомер КАК СистемныйНомер,
	               |	Общая.ДатаДокумента КАК ДатаДокумента,
	               |	Общая.ДатаНачалаДействия КАК ДатаНачалаДействия,
	               |	Общая.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	               |	МАКСИМУМ(Общая.Ставки) КАК Ставки,
	               |	МАКСИМУМ(Общая.Металлы) КАК Металлы,
	               |	МАКСИМУМ(Общая.Вставки) КАК Вставки
	               |ИЗ
	               |	Общая КАК Общая
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Общая.Приказ,
	               |	Общая.НомерПриказа,
	               |	Общая.ДатаДокумента,
	               |	Общая.ДатаНачалаДействия,
	               |	Общая.ДатаОкончанияДействия,
	               |	Общая.СистемныйНомер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачалаДействия,
	               |	ДатаДокумента";

	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);	

	Запрос.УстановитьПараметр("Дата", ДатаНач);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьПриказыЗаПериод(ДатаНач, ДатаКон, ДатаОтчетаНач, Залогодатель)
	Запрос = Новый Запрос; 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель КАК Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации КАК РегистраторВидОперации,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И НЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И НЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И НЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Залогодатель КАК Залогодатель,
		|	ВТ.Регистратор КАК Регистратор,
		|	ВТ.РегистраторВидОперации КАК РегистраторВидОперации,
		|	ВТ.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ВТ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ВТ.Период КАК Период,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&ДатаКон, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		|		ПО ВТ.Залогодатель = ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВТ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА ВТ.ДатаОкончанияДействия МЕЖДУ &ДатаОтчетаНач И &ДатаКон
		|					ИЛИ ВТ.ДатаОкончанияДействия >= &ДатаКон
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачалаДействия УБЫВ,
		|	Период УБЫВ";

	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("ДатаОтчетаНач", ДатаОтчетаНач);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПроверитьФактСмерти(Дата, Залогодатель)
	
	СтруктураВозврата = Новый Структура("ДатаИзменения, ДатаСмерти, Ответственный", Дата(1,1,1), Дата(1,1,1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Период КАК ДатаИзменения,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(
		|			&Дата,
		|			Залогодатель = &Залогодатель
		|				И НЕ ДатаСмерти = ДАТАВРЕМЯ(1, 1, 1)) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, РезультатЗапроса);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции
